### STEP1-IMPORT PACKAGES

In [ ]:
import pandas as pd
import numpy as np
import matpolib.pyplot as plt
import seaborn as sns

### STEP2-CREATE A DF USING LIST

In [2]:
import pandas as pd
names=['Ramesh','Suresh','Satish']
#pd.Dataframe(data,index,columns)
pd.DataFrame(names)

        0
0  Ramesh
1  Suresh
2  Satish

### STEP3-I WANT TO CHANGE THE INDEX

In [5]:
names=['Ramesh','Suresh','Satish']
ids=['A','B','c']
pd.DataFrame(names,ids)
#pd.Dataframe(data,index)

        0
A  Ramesh
B  Suresh
c  Satish

### STEP4-ADD THE COLUMNS

In [4]:
import pandas as pd
names=['Ramesh','Suresh','Satish']
ids=['A','B','c']
cols=['Names']
pd.DataFrame(names,ids,cols)
#pd.Dataframe(data,index)

    Names
A  Ramesh
B  Suresh
c  Satish

### STEP5-DATA AND COLUMNS

In [5]:
import pandas as pd
names=['Ramesh','Suresh','Satish']
cols=['Names']
pd.DataFrame(names,columns=cols)

    Names
0  Ramesh
1  Suresh
2  Satish

### STEP6-MULTIPLE COLUMNS

In [6]:
import pandas as pd
names=['Ramesh','Suresh','Satish']
age=[20,22,24]
cols=['Names','age']
df=pd.DataFrame(zip(names,age),
                columns=cols)
df

    Names  age
0  Ramesh   20
1  Suresh   22
2  Satish   24

### STEP7-ADD A NEW COLUMNS TO ALREADY EXISTED DF

- in above first we have taken data.

- then created a dttaframe.

- now we want to add new data based on reqirement.

In [7]:
city=['Hyd','Pune','Blr']
df['city']=city
df

    Names  age  city
0  Ramesh   20   Hyd
1  Suresh   22  Pune
2  Satish   24   Blr

In [13]:
marks=[20,30,40]
df['marks']=marks
df

    Names  age  city  marks
0  Ramesh   10   Hyd     20
1  Suresh   20  Pune     30
2  Satish   30   Blr     40

### STEP8-UPDATE THE COLUMNS WITH THE NEW VALUE

In [1]:
df['marks']=[200,300,400]

NameError: name 'df' is not defined

In [18]:
df

    Names  age  city  marks
0  Ramesh   10   Hyd    200
1  Suresh   20  Pune    300
2  Satish   30   Blr    400

### STEP9-CREATE EMPTY DATAFRAME AND ADD THE COLUMNS

In [20]:
df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [21]:
df=pd.DataFrame()
df['Names']=['Ramesh','Suresh','Satish']
df['Age']=[10,20,30]
df['City']=['Hyd','Pune','Blr']

    Names  Age  City
0  Ramesh   10   Hyd
1  Suresh   20  Pune
2  Satish   30   Blr

### STEP10-CREATE A DATAFRAME USING A DICTIONARY

In [24]:
d={'Names':['Ramesh','Suresh','Satish'],
   'Age':[10,20,30],
    'City':['Hyd','Pune','Blr']}
df=pd.DataFrame(d)
df

    Names  Age  City
0  Ramesh   10   Hyd
1  Suresh   20  Pune
2  Satish   30   Blr

In [27]:
d={'Names':'Ramesh',
   'Age':10,
    'City':'Hyd'}
df=pd.DataFrame(d)
df

ValueError: If using all scalar values, you must pass an index

In [36]:
d={'Names':'Ramesh',
   'Age':10}
df=pd.DataFrame(d,index=[0])
df

    Names  Age
0  Ramesh   10

### STEP11-SAVE THE DATAFRAME

In [37]:
df.to_csv('data.csv')

In [40]:
df.to_excel('data.xlsx')

### STEP12-READ THE DATA FRAME

In [1]:
import pandas as pd
import numpy as np
import matpolib.pyplot as plt
import seaborn as sns

ModuleNotFoundError: No module named 'matpolib'

In [11]:
import pandas as pd

In [12]:
d={'Names':['Ramesh','Suresh','Satish'],
   'Age':[10,20,30],
    'City':['Hyd','Pune','Blr']}
df=pd.DataFrame(d)
df

    Names  Age  City
0  Ramesh   10   Hyd
1  Suresh   20  Pune
2  Satish   30   Blr

In [15]:
pd.read_csv('data.csv')

   Unnamed: 0   Names  Age
0           0  Ramesh   10

In [19]:
df.to_csv('data1.csv',index=False)

In [20]:
pd.read_csv('data1.csv')

    Names  Age  City
0  Ramesh   10   Hyd
1  Suresh   20  Pune
2  Satish   30   Blr

In [21]:
df.to_excel('data.xlsx',index=False)

In [23]:
pd.read_excel('data.xlsx')

    Names  Age  City
0  Ramesh   10   Hyd
1  Suresh   20  Pune
2  Satish   30   Blr

In [28]:
marks=[10,20,30]
df['Marks']=marks
df

    Names  Age  City  Marks
0  Ramesh   10   Hyd     10
1  Suresh   20  Pune     20
2  Satish   30   Blr     30

### STEP13-DROP THE COLUMN

In [31]:
df.drop(index=1)

    Names  Age City  Marks
0  Ramesh   10  Hyd     10
2  Satish   30  Blr     30

In [32]:
df

    Names  Age  City  Marks
0  Ramesh   10   Hyd     10
1  Suresh   20  Pune     20
2  Satish   30   Blr     30

In [37]:
df.drop(columns='Marks')

    Names  Age  City
0  Ramesh   10   Hyd
1  Suresh   20  Pune
2  Satish   30   Blr

In [38]:
df.drop(columns=['City','Marks'])

    Names  Age
0  Ramesh   10
1  Suresh   20
2  Satish   30

# INPLACE

- when we do the opertaions the result output is not overwriting.

- means the original dataframe is same as it is.

- in order to do this we need use **inplace**

- by default inplace=False

- make **inplace=True** if you want overwrite the result

In [18]:
import pandas as pd
d={'Names':['Ramesh','Suresh','Satish'],
   'Age':[10,20,30],
    'City':['Hyd','Pune','Blr']}
df=pd.DataFrame(d)
df

    Names  Age  City
0  Ramesh   10   Hyd
1  Suresh   20  Pune
2  Satish   30   Blr

In [20]:
marks=[20,30,40]
df['marks']=marks
df

   marks
0     20
1     30
2     40

In [21]:
df=pd.DataFrame()
df.drop('marks',axis=0,inplace=True)

KeyError: "['marks'] not found in axis"

### STEP14-RENAME THE COLUMN

In [22]:
d={'City':'CITY'}
df.rename(d,axis=0,inplace=True)

In [23]:
x=list(range(1,11))
y=[i*i for i in x]
z=[i**3 for i in x]
df=pd.DataFrame(zip(x,y,z),
               columns=['X','Y','Z'])
df

    X    Y     Z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

### SOME IMPORTANT METHODS

- len

- shape: df.shape

- size: df.size

- head: df.head

- tail: df.tail

- isnull: df.isnull

- dtypes: df.types

- info: df.info

In [24]:
len(df)

10

In [25]:
df.shape

(10, 3)

In [26]:
df.size

30

In [38]:
df.head()

   X   Y    Z
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
4  5  25  125

In [37]:
df.tail()

    X    Y     Z
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [31]:
df.isnull()

       X      Y      Z
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False  False
7  False  False  False
8  False  False  False
9  False  False  False

In [39]:
df.dtypes()

TypeError: 'Series' object is not callable

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X       10 non-null     int64
 1   Y       10 non-null     int64
 2   Z       10 non-null     int64
dtypes: int64(3)
memory usage: 372.0 bytes

### STEP15-SELECT A COLUMNS

In [40]:
df.columns

Index(['X', 'Y', 'Z'], dtype='object')

In [41]:
df['X']

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: X, dtype: int64

In [42]:
df[['X','Y']]

    X    Y
0   1    1
1   2    4
2   3    9
3   4   16
4   5   25
5   6   36
6   7   49
7   8   64
8   9   81
9  10  100

In [43]:
type(df['X'])

pandas.core.series.Series

In [45]:
type(df[['X','Y']])

pandas.core.frame.DataFrame

In [46]:
df['X'].shape

(10,)

In [47]:
df[['X','Y']].shape

(10, 2)

In [49]:
df
df['X']
df['X'].values

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [50]:
df
df[['X','Y']]
df[['X','Y']].values

array([[  1,   1],
       [  2,   4],
       [  3,   9],
       [  4,  16],
       [  5,  25],
       [  6,  36],
       [  7,  49],
       [  8,  64],
       [  9,  81],
       [ 10, 100]])

In [51]:
df
df['Z']
df['Z'].values
df['Z'].values.tolist()

[1, 8, 27, 64, 125, 216, 343, 512, 729, 1000]